package school.sorokin.javacore.basics;
/*Задача:
Написать программу, которая помогает пользователю выбрать жанр фильма для просмотра. Пусть программа:
Предлагает ввести число от 1 до 5 (1 — комедия, 2 — драма, 3 — фантастика, 4 — боевик, 5 — аниме).
В зависимости от введённого числа предлагает несколько известных фильмов этого жанра
(можно ограничиться 1–2 названиями).
Если число не входит в диапазон 1–5, выводит сообщение: «Такого жанра не знаю».

Требования:
Воспользоваться оператором switch.
Продумать, нужно ли вам использовать if-else.
Возможно, перед switch стоит проверить, что введённое пользователем число вообще корректно.
Программа должна считывать данные из консоли (например, через Scanner) и выводить результат в консоль.*/

import java.util.Scanner;

public class IfElseLesson {
    public static void main(String[] args) {
        System.out.print("Что хотите посмотреть? Введите число от 1 до 5: ");
        Scanner scanner = new Scanner(System.in);
        int choice = scanner.nextInt();
        scanner.close();

        switch (choice) {
            case 1:
                System.out.println("Жанр - комедия. " +
                        "Посмотрите \"Иван Васильевич меняет профессию\" или \"Джуманджи\"");
                break;
            case 2:
                System.out.println("Жанр - драма. " +
                        "Посмотрите новости");
                break;
            case 3:
                System.out.println("Жанр - фантастика. " +
                        "Посмотрите \"Аватар\"");
                break;
            case 4:
                System.out.println("Жанр - боевик. " +
                        "Посмотрите \"Брюс Ли\"");
                break;
            case 5:
                System.out.println("Жанр - аниме. " +
                        "Посмотрите \"Япония\"");
                break;
            default:
                System.out.println("Такого жанра не знаю.");
        }
    }
}