package school.sorokin.javacore.basics;

/*Напишите программу, которая:
Объявляет переменные типов byte, short, int, long, float, double, boolean и char.
Инициализирует каждую переменную осмысленным значением
(например, температуру, число населения, индикатор истинности условия и т. п.).
Выводит каждую переменную на консоль вместе с описанием.
Создаёт вторую переменную типа int
и присваивает ей значение из long переменной с явным приведением.
Проверьте, не будет ли потеря данных.
(Дополнительно) С помощью char и математических операций попробуйте
вывести в консоль несколько последовательных символов.
Например, взяв 'A' и увеличивая код на 1, 2, 3.
Подсказка: для пунктов 4 и 5 обязательно учитывайте,
что при приведении (casting) вы можете потерять часть информации.*/

public class VariablesLesson {
    public static void main(String[] args) {
        byte age = 127;
        short index = 32767;
        int number = 800;
        long peopleCount = 8_000_000_000L;
        float pi = 3.14f;
        double dbl = 64.0;
        boolean flag = true;
        char symbol = 'p';
        System.out.printf("В byte хранятся целые числа в диапазоне от -128 до 127 включительно. " +
                "Он занимает 8 бит памяти (1 байт). Например, %d", age);
        System.out.println();
        System.out.printf("В short хранят целые числа в диапазоне от -32 768 до 32 767. " +
                "Он занимает 16 бит (2 байта) памяти. Например, %d", index);
        System.out.println();
        System.out.printf("В int хранят целые числа в диапазоне " +
                "от -2,147,483,648 до 2,147,483,647. " +
                "Он занимает 32 бита (4 байта) памяти. Например, %d", number);
        System.out.println();
        System.out.printf("В long хранят целые числа в диапазоне " +
                "от -9,223,372,036,854,775,808 до 9,223,372,036,854,775,807. " +
                "Он занимает 64 бита (8 байт) памяти и является самым большим целочисленным типом в Java. " +
                "Например, %d", peopleCount);
        System.out.println();
        System.out.printf("Тип float занимает 32 бита (4 байта) памяти." +
                "и используется для представления чисел с десятичной точкой," +
                "где важна скорость вычислений и нет строгих требований к точности. Например, %s", pi);
        System.out.println();
        System.out.printf("В double хранят числа с плавающей запятой (дробные числа), " +
                "такие как 3.14159, -12.345, или 1.23e-4. " +
                "Он занимает 64 бита (8 байт) памяти и является типом с двойной точностью. " +
                "Например, %s", dbl);
        System.out.println();
        System.out.printf("В boolean хранятся только два возможных значения: " +
                "true (истина) или false (ложь). " +
                "Он занимает всего 1 бит памяти, но в Java ему обычно отводится 1 байт.Например, %s", flag);
        System.out.println();
        System.out.printf("В char хранят символы, такие как " +
                "буквы, цифры, знаки препинания и другие символы Unicode. " +
                "Он занимает 16 бит (2 байта) памяти. Например, %s", symbol);
        System.out.println();

       int a = (int)peopleCount;
        System.out.printf("Downcasting long --> int: %d --> %d", peopleCount, a);
        System.out.println();

        for (int i = 0; i < 10; i++) {
            symbol++;
            System.out.print(symbol + " ");
        }
    }
}
