package school.sorokin.javacore.oop.lesson1;

/*Задача:
Создайте класс Book для библиотеки. Класс должен содержать следующие поля: title (название книги),
author (автор книги) и pages (количество страниц).
Также добавьте метод read, который выводит сообщение о том, что вы читаете книгу.
Шаги выполнения:
Создайте класс Book с указанными полями.
Реализуйте метод read, который выводит, например, “Вы читаете книгу ‘Название книги’ авторства Автор.”
В классе Main создайте объект Book, инициализируйте его поля и вызовите метод read.
Пример ожидаемого результата:
Вы читаете книгу 'Война и мир' авторства Лев Толстой.*/
public class Book {
    public String title;
    public String author;
    public int pages;

    public void read() {
        System.out.printf("Вы читаете книгу '%s' авторства %s.", title, author);
    }
}
