package school.sorokin.javacore.oop.lesson1;
/*Задача:
Создайте класс Book для библиотеки.
Класс должен содержать следующие поля: title (название книги),
author (автор книги) и pages (количество страниц).
Также добавьте метод read, который выводит сообщение о том, что вы читаете книгу.
Шаги выполнения:
Создайте класс Book с указанными полями.
Реализуйте метод read, который выводит, например, “Вы читаете книгу ‘Название книги’ авторства Автор.”
В классе Main создайте объект Book, инициализируйте его поля и вызовите метод read.
Пример ожидаемого результата:
Вы читаете книгу 'Война и мир' авторства Лев Толстой.*/

public class Main {
    public static void main(String[] args) {
        Book book = new Book ();
        book.title = "Война и мир";
        book.author = "Лев Толстой";
        book.pages = 1236;
        book.read();
    }
}
