package school.sorokin.javacore.reflection.lesson1;
/*Создайте класс Person (или любой класс на ваш выбор) с несколькими полями и методами
 (например, name, age, sayHello()). В main-методе:
Получите объект Class для этого класса (используйте один из трёх способов).
Выведите в консоль полное имя класса, его простой вариант имени и список интерфейсов,
которые он реализует.
Добавьте вывод модификаторов класса (числом).
Если хотите, попробуйте воспользоваться классом Modifier, чтобы преобразовать это число в читабельный вид.

Подсказки:
Не увлекайтесь большим количеством логики в методах класса.
Важно именно научиться «смотреть» в структуру объекта через Class.
Если что-то непонятно по коду — можете временно закомментировать строки и смотреть,
что будет компилироваться, а что нет.
*/
public class Person {
    private String name;
    private int age;

    public Person(String name, int age) {
    }

    void sayHello(){
        System.out.println("Hello!");
    }
}
